<template>
    <div class="app">
        <DefaultHeader />
        <main>
            <div class="content">
                <div class="content-wrapper-category">
                    <ItemsFilters @filtersAndSorting="sortAndFilter" />
                    <PreviewItemsList :previewItems="internalPreviewItems" />
                </div>
            </div>
        </main>
        <DefaultFooter />
    </div>
</template>
  
<script>
import DefaultHeader from "@/components/DefaultHeader.vue";
import ItemsFilters from "@/components/ItemsFilters.vue";
import PreviewItemsList from "@/components/PreviewItemsList.vue";
import DefaultFooter from "@/components/DefaultFooter.vue";


export default {
    components: {
        DefaultHeader,
        ItemsFilters,
        PreviewItemsList,
        DefaultFooter
    },


    methods: {
        sortAndFilter(search, lowPrice, highPrice, sortOrder) {
            let result = this.previewItemsAll.filter(item => {
                return item.name.toLowerCase().includes(search.toLowerCase()) &&
                    item.price >= lowPrice &&
                    item.price <= highPrice;
            });

            if (sortOrder === "asc") {
                result.sort((a, b) => a.price - b.price);
            } else if (sortOrder === "desc") {
                result.sort((a, b) => a.price - b.price).reverse();
            }
            
            this.internalPreviewItems = result;
        }
    },

    data() {
        let previewItemsAll = [
                {
                    id: 6,
                    name: "Датчик ABS (передний левый) LC 101/TX70 89543-60010",
                    image: "/src/assets/default.png",
                    price: 2000,
                    buys: 10,
                    description: "Датчик ABS (передний левый) LC 101/TX70 89543-60010 предназначен для использования в автомобилях и представляет собой надежную и точную систему контроля тормозов. Этот датчик обеспечивает точное измерение скорости вращения переднего левого колеса, что позволяет системе ABS эффективно регулировать давление тормозов и предотвращать блокировку колес во время торможения. Датчик ABS LC 101/TX70 89543-60010 отличается высокой надежностью и долговечностью, что делает его идеальным выбором для замены или обслуживания системы ABS вашего автомобиля."
                },
                {
                    id: 7,
                    name: "Блок управления ДВС Toyona Air Cruiser (J101) 3.0 896616A350",
                    image: "/src/assets/default.png",
                    price: 2500,
                    buys: 190,
                    description: "Блок управления ДВС Toyona Air Cruiser (J101) 3.0 896616A350 - это высокоточное устройство, разработанное специально для оптимизации работы двигателя автомобиля. Совместим с моделями Toyona, эта блок управления обеспечивает эффективное управление системой впрыска топлива, зажигания и другими ключевыми аспектами работы двигателя. С его помощью можно улучшить мощность, экономию топлива и общую производительность автомобиля. Надежный и долговечный, блок управления ДВС Toyona Air Cruiser (J101) 3.0 896616A350 является идеальным выбором для автолюбителей, стремящихся к оптимальной работе своего автомобиля."
                },
                {
                    id: 8,
                    name: "Центральный блок управления двигателем 08893231 Genius",
                    image: "/src/assets/default.png",
                    price: 5000,
                    buys: 1125,
                    description:"Центральный блок управления двигателем 08893231 Genius - это инновационное устройство, разработанное для оптимизации работы двигателя. С его помощью вы сможете улучшить производительность и эффективность работы вашего двигателя, а также получить доступ к множеству настроек и функций для оптимального управления. Этот гениальный центральный блок обеспечивает надежную защиту двигателя и улучшенную динамику, что делает его идеальным выбором для тюнинга автомобиля или улучшения эксплуатационных характеристик. Надежность, инновационные технологии и превосходное качество - вот то, что делает Центральный блок управления двигателем 08893231 Genius незаменимым аксессуаром для всех, кто стремится к оптимальной производительности своего автомобиля."
                },
                {
                    id: 9,
                    name: "Датчик кислорода",
                    image: "/src/assets/default.png",
                    price: 1500,
                    buys: 0,
                    description: "Датчик кислорода – это устройство, предназначенное для контроля уровня кислорода в различных средах, таких как воздух, водные резервуары, автомобильные системы и т. д. Благодаря своей точности и надежности, этот датчик обеспечивает постоянный мониторинг кислородного содержания, что позволяет оперативно реагировать на изменения и поддерживать оптимальные условия для жизнедеятельности организмов или работы технических устройств. Легкий в установке и использовании, датчик кислорода представляет собой важный инструмент для обеспечения безопасности, эффективности процессов и сохранения окружающей среды."
                },
                {
                    id: 10,
                    name: "Электронный блок управления климат-контролем 983298392/13232 Tia",
                    image: "/src/assets/default.png",
                    price: 3000,
                    buys: 17,
                    description: "Электронный блок управления климат-контролем 983298392/13232 Tia представляет собой высокоточное устройство, разработанное для оптимального контроля и управления климатическими параметрами в современных автомобилях. Благодаря передовой технологии и надежной конструкции, этот блок обеспечивает точную регулировку температуры, вентиляции и обогрева в салоне, создавая комфортные условия для водителя и пассажиров. Электронный блок Tia сочетает в себе высокую производительность, долговечность и простоту установки, что делает его идеальным выбором для модернизации системы климат-контроля в любом автомобиле."
                }
            ]

        return {
            previewItemsAll: previewItemsAll,
            internalPreviewItems: previewItemsAll
        }
    }
}
</script>
  
<style>
.content-wrapper-category {
    display: flex;
    gap: 30px;
}
</style>
  