<template>
    <div class="app">
        <DefaultHeader />
        <main>
            <div class="content">
                <div class="content-wrapper-category">
                    <ItemsFilters @filtersAndSorting="sortAndFilter" />
                    <PreviewItemsList :previewItems="internalPreviewItems" />
                </div>
            </div>
        </main>
        <DefaultFooter />
    </div>
</template>
  
<script>
import DefaultHeader from "@/components/DefaultHeader.vue";
import ItemsFilters from "@/components/ItemsFilters.vue";
import PreviewItemsList from "@/components/PreviewItemsList.vue";
import DefaultFooter from "@/components/DefaultFooter.vue";


export default {
    components: {
        DefaultHeader,
        ItemsFilters,
        PreviewItemsList,
        DefaultFooter
    },


    methods: {
        sortAndFilter(search, lowPrice, highPrice, sortOrder) {
            let result = this.previewItemsAll.filter(item => {
                return item.name.toLowerCase().includes(search.toLowerCase()) &&
                    item.price >= lowPrice &&
                    item.price <= highPrice;
            });

            if (sortOrder === "asc") {
                result.sort((a, b) => a.price - b.price);
            } else if (sortOrder === "desc") {
                result.sort((a, b) => a.price - b.price).reverse();
            }
            
            this.internalPreviewItems = result;
        }
    },

    data() {
        let previewItemsAll = [
                {
                    id: 16,
                    name: "Выхлопная труба SuperCar 09876782-90129",
                    image: "/src/assets/default.png",
                    price: 20000,
                    buys: 145,
                    description: "Превратите свой автомобиль в настоящего гонщика с выхлопной трубой SuperCar 09876782-90129. Эта высококачественная труба не только обеспечивает максимальный поток выхлопных газов, но и создает неповторимый рычащий звук, который привлечет восхищенные взгляды окружающих. Изготовленная из прочной, нержавеющей стали, она обеспечивает удивительную прочность и долговечность. Установите трубу SuperCar 09876782-90129 и почувствуйте мощь и стиль вашего автомобиля!"
                },
                {
                    id: 17,
                    name: "Пламегаситель Bercedes-Tenz 90138912 Е class",
                    image: "/src/assets/default.png",
                    price: 1700,
                    buys: 198,
                    description: "Пламегаситель Bercedes-Tenz 90138912 Е class - это надежный и высококачественный компонент, который обеспечивает безопасное и эффективное функционирование системы выхлопных газов вашего автомобиля. Изготовленный из специального материала, он обладает отличной теплостойкостью и долговечностью, что обеспечивает надежную защиту от перегрева и повреждений. Специально разработанный для эффективного снижения уровня шума и вибраций, этот пламегаситель обеспечивает более комфортное вождение и минимизирует негативное воздействие на окружающую среду. Установка данного компонента позволит вашему автомобилю работать на высоком уровне производительности и безопасности, обеспечивая оптимальное функционирование системы выхлопных газов."
                },
                {
                    id: 18,
                    name: "Пламегаситель Bercedes-Tenz 1323 T class",
                    image: "/src/assets/default.png",
                    price: 1700,
                    buys: 150,
                    description: "Пламегаситель Bercedes-Tenz 1323 T class - это надежный и высококачественный компонент, специально разработанный для обеспечения эффективного функционирования системы выхлопных газов вашего автомобиля класса T. Изготовленный из специального материала с уникальной теплостойкостью, он обеспечивает надежную защиту от перегрева и повреждений, что делает его идеальным выбором для автомобилей, работающих в условиях повышенных нагрузок. Этот пламегаситель также способствует снижению уровня шума и вибраций, обеспечивая более комфортное вождение и минимизируя воздействие на окружающую среду. Установка данного компонента поможет вашему автомобилю работать на высоком уровне производительности и безопасности, обеспечивая оптимальное функционирование системы выхлопных газов и продлевая срок службы вашего автомобиля."
                },
                {
                    id: 19,
                    name: "Пайпы All Korean",
                    image: "/src/assets/default.png",
                    price: 300,
                    buys: 305,
                    description: "Пайпы All Korean - это надежные и высококачественные выхлопные трубы, специально разработанные для автомобилей корейского производства. Изготовленные из прочного материала с уникальной теплостойкостью, они обеспечивают эффективное отведение выхлопных газов, минимизируя их воздействие на окружающую среду. Эти выхлопные трубы также способствуют снижению уровня шума и вибраций, обеспечивая более комфортное вождение. Установка 'Пайпов All Korean' поможет вашему автомобилю работать на высоком уровне производительности и безопасности, обеспечивая оптимальное функционирование системы выхлопных газов и продлевая срок службы вашего автомобиля."
                },
                {
                    id: 20,
                    name: "Насадки 900dp 9878392",
                    image: "/src/assets/default.png",
                    price: 2500,
                    buys: 1106,
                    description: "Насадки 900dp 9878392 - это инновационные выхлопные насадки, разработанные для автомобилей с высокой производительностью. Изготовленные из прочного и легкого материала, они обеспечивают эффективное отведение выхлопных газов, что способствует улучшению мощности двигателя и снижению расхода топлива. Уникальный дизайн насадок 900dp 9878392 также способствует снижению шума и вибраций, обеспечивая более комфортное вождение. Установка этих насадок поможет вашему автомобилю работать на высоком уровне производительности, а их стильный внешний вид добавит эстетического очарования вашему автомобилю." 
                }
            ]
        return {
            previewItemsAll: previewItemsAll,
            internalPreviewItems: previewItemsAll
        }
    }
}
</script>
  
<style>
.content-wrapper-category {
    display: flex;
    gap: 30px;
}
</style>
  