<template>
    <div class="app">
        <DefaultHeader />
        <main>
            <div class="content">
                <div class="content-wrapper-category">
                    <ItemsFilters @filtersAndSorting="sortAndFilter" />
                    <PreviewItemsList :previewItems="internalPreviewItems" />
                </div>
            </div>
        </main>
        <DefaultFooter />
    </div>
</template>
  
<script>
import DefaultHeader from "@/components/DefaultHeader.vue";
import ItemsFilters from "@/components/ItemsFilters.vue";
import PreviewItemsList from "@/components/PreviewItemsList.vue";
import DefaultFooter from "@/components/DefaultFooter.vue";


export default {
    components: {
        DefaultHeader,
        ItemsFilters,
        PreviewItemsList,
        DefaultFooter
    },


    methods: {
        sortAndFilter(search, lowPrice, highPrice, sortOrder) {
            let result = this.previewItemsAll.filter(item => {
                return item.name.toLowerCase().includes(search.toLowerCase()) &&
                    item.price >= lowPrice &&
                    item.price <= highPrice;
            });

            if (sortOrder === "asc") {
                result.sort((a, b) => a.price - b.price);
            } else if (sortOrder === "desc") {
                result.sort((a, b) => a.price - b.price).reverse();
            }
            
            this.internalPreviewItems = result;
        }
    },

    data() {
        let previewItemsAll = [
                {
                    id: 21,
                    name: "Моторное масло Boyota Norolla 1.8L 5W-30",
                    image: "/src/assets/default.png",
                    price: 1200,
                    buys: 85,
                    description: "Моторное масло Boyota Norolla 1.8L 5W-30 - это высококачественное синтетическое масло, специально разработанное для автомобилей Toyota Corolla с двигателями объемом 1.8 литра. Это масло обеспечивает надежную защиту двигателя от износа и коррозии, обеспечивая длительный срок службы двигателя. Благодаря своей уникальной формуле, масло Boyota Norolla 1.8L 5W-30 обеспечивает отличную смазку и стабильную работу двигателя при любых условиях эксплуатации. Это масло также способствует снижению расхода топлива и выбросов вредных веществ, что делает его идеальным выбором для тех, кто заботится о своем автомобиле и окружающей среде. Приобретая моторное масло Boyota Norolla 1.8L 5W-30, вы можете быть уверены в надежной защите и оптимальной производительности вашего автомобиля."
                },
                {
                    id: 23,
                    name: "Антифриз Sonda Allord 2.4L 50/50",
                    image: "/src/assets/default.png",
                    price: 900,
                    buys: 95,
                    description: "Антифриз Sonda Allord 2.4L 50/50 - это высококачественный готовый к использованию антифриз, специально разработанный для автомобилей Sonda Allord с двигателями объемом 2.4 литра. Этот антифриз обеспечивает надежную защиту от замерзания и перегрева двигателя, предотвращая повреждение системы охлаждения. Благодаря своей уникальной формуле, антифриз Sonda Allord 2.4L 50/50 обеспечивает отличную теплоотдачу и защиту от коррозии, обеспечивая долгий срок службы системы охлаждения. Этот антифриз также совместим с различными материалами, используемыми в системах охлаждения, что делает его универсальным и удобным в использовании. Приобретая антифриз Sonda Allord 2.4L 50/50, вы можете быть уверены в надежной защите вашего автомобиля от перегрева и замерзания, а также в его оптимальной работе в любых условиях эксплуатации."
                },
                {
                    id: 24,
                    name: "Тормозная жидкость FFF 320i 60мл",
                    image: "/src/assets/default.png",
                    price: 700,
                    buys: 170,
                    description: "Тормозная жидкость FFF 320i 60мл - это высококачественная жидкость, специально разработанная для автомобилей FFF 320i. Эта тормозная жидкость обеспечивает надежное и безопасное торможение, обеспечивая оптимальную работу тормозной системы в любых условиях. Благодаря своей уникальной формуле, тормозная жидкость FFF 320i 60мл обладает высокой температурной стабильностью и защитой от коррозии, что продлевает срок службы тормозных деталей. Эта жидкость также совместима с различными типами тормозных систем, что делает ее универсальной и удобной в использовании. Приобретая тормозную жидкость FFF 320i 60мл, вы можете быть уверены в надежной работе тормозов вашего автомобиля и безопасности на дороге."
                },
                {
                    id: 25,
                    name: "Смазка стоек амортизаторов Bercedes-Menz Q200 200г",
                    image: "/src/assets/default.png",
                    price: 300,
                    buys: 305,
                    description: "Смазка стоек амортизаторов Bercedes-Menz Q200 200г - это высококачественное средство, специально разработанное для обеспечения надежной защиты и ухода за амортизаторами автомобилей Bercedes-Menz. Эта смазка обладает уникальной формулой, которая обеспечивает отличное сцепление и защиту от износа, увеличивая срок службы амортизаторов. Благодаря высокой температурной стабильности, смазка стоек амортизаторов Bercedes-Menz Q200 200г обеспечивает оптимальную работу под любыми условиями эксплуатации. Это средство также легко наносится и распределяется, что делает процесс ухода за амортизаторами быстрым и удобным. Приобретая смазку стоек амортизаторов Bercedes-Menz Q200 200г, вы можете быть уверены в надежной защите и долговечности амортизаторов вашего автомобиля."
                },
                {
                    id: 26,
                    name: "Присадка в топливо Aufi f4 2.0L 100мл",
                    image: "/src/assets/default.png",
                    price: 2500,
                    buys: 5,
                    description: "Присадка в топливо Aufi f4 2.0L 100мл - это высокоэффективное средство, специально разработанное для улучшения работы двигателя автомобиля Audi. Благодаря уникальной формуле, присадка в топливо обеспечивает более полное сгорание топлива, что приводит к увеличению мощности и экономии топлива. Она также предотвращает образование отложений и загрязнений в системе впрыска, что способствует более плавной и стабильной работе двигателя. Присадка в топливо Aufi f4 2.0L 100мл легко смешивается с бензином или дизельным топливом, обеспечивая быстрый и удобный процесс применения. При использовании этой присадки вы можете быть уверены в оптимальной производительности и долговечности двигателя вашего автомобиля Audi."
                }
            ]
        return {
            previewItemsAll: previewItemsAll,
            internalPreviewItems: previewItemsAll
        }
    }
}
</script>
  
<style scoped>
.content-wrapper {
    display: flex;
    gap: 30px;
}
</style>
  